7Ji/esp8266-temp-monitor-and-pc-reset/src/main.cpp
    Serial.printf("Writing L1 to page %" PRIu16 "/f%" PRIu16 "\n", pageID, flashPageID);
    opResult = spi_flash_write(flashPageID * FlashPageSize, sliceL1Raw, FlashPageSize);
    if (opResult != SPI_FLASH_RESULT_OK) {
      Serial.printf("Failed to write L1 to page %" PRIu16 "/f%" PRIu16 ", op result %d\n", pageID, flashPageID, opResult);
      return false;
    }
    return true;
  }

  void fallbackShift() {
    Serial.println("Falling back to shift L1 by one position");
    sliceL1.shift();
    countL1 = SensorSlice::MaxRecordsSub1;
  }

  void appendL1(SensorValue const &valueL0, uint64_t const unixSeconds) {
    uint64_t diff64;
    SensorRecord recordL1 = {.value = valueL0};

    if (countL1 > 0) {
      /* Unlikely to happen, but just in case */
      diff64 = unixSeconds - sliceL1.unixOffset;
      if (diff64 > UINT16_MAX) {
        Serial.printf("Dropping partial L1 with too-wide timestamp delta %" PRIu64 "\n", diff64);
        countL1 = 0;
      }
    }

    if (countL1 == 0) {
      sliceL1.unixOffset = unixSeconds;
      recordL1.timestamp = 0;
    } else {
      recordL1.timestamp = unixSeconds - sliceL1.unixOffset;
    }
    sliceL1.records[countL1++] = recordL1;
  }

  void flushL1L2() {
    uint16_t const pageID = slicePage(countL2);
    bool const afterBoundary = pageID & FlashPageInSectMask;

    Serial.printf("Flushing L1 to L2 flash page %" PRIu16 "\n", pageID);

    if (!afterBoundary) {
      /* Whether we successfully erase the sector or not, consider pages on it bad */
      if (countL2 > FlashPageTotalSubSect) { /* Technically this could only be countL2 == FlashPageTotal, but do this securely */
        headL2 = (headL2 + 1) % FlashSectTotal;
        countL2 = FlashPageTotalSubSect;
      }
      if (!erase(pageID >> FlashSectPageFactor)) {
        fallbackShift();
        return;
      }
    }
    sliceL1.checksum = sliceL1.actualChecksum();
    if (!writeL1(pageID)) {
      fallbackShift();
      return;
    }
    countL1 = 0;
    ++countL2;
  }

  bool erasedL2() {
    uint16_t wordID;

    for (wordID = 0; wordID < SensorSlice::CountAll32; ++ wordID) {
      if (sliceL2Raw[wordID] != UINT32_MAX) {
        return false;
      }
    }
    return true;
  }

  bool fetchFlashPage(uint16_t const flashPageID) {
    SpiFlashOpResult opResult;

    opResult = spi_flash_read(flashPageID * FlashPageSize, sliceL2Raw, FlashPageSize);

    if (opResult != SPI_FLASH_RESULT_OK) {
      Serial.printf("fetch f%" PRIu16 ": Read not OK, op result %d\n", flashPageID, opResult);
      return false;
    }
    return sliceL2.valid();
  }

  bool fetchPage(uint16_t const pageID) {
    return fetchFlashPage(pageID + FlashPageStart);
  }

  static bool recoverReadPage(void *ctx, uint16_t const flashPageID) {
    SensorHistory *const self = static_cast<SensorHistory *>(ctx);
    SpiFlashOpResult const opResult = spi_flash_read(flashPageID << FlashPageExp, self->sliceL2Raw, FlashPageSize);

    if (opResult != SPI_FLASH_RESULT_OK) {
      Serial.printf("fetch f%" PRIu16 ": Read not OK, op result %d\n", flashPageID, opResult);
      return false;
    }
    return true;
  }

  static bool recoverIsErased(void *ctx) {
    return static_cast<SensorHistory *>(ctx)->erasedL2();
  }

  static bool recoverIsValid(void *ctx) {
    return static_cast<SensorHistory *>(ctx)->sliceL2.valid();
  }

  static uint64_t recoverUnixOffset(void *ctx) {
    return static_cast<SensorHistory *>(ctx)->sliceL2.unixOffset;
  }

  void recoverFlash() {
    RecoverFlashConfig const config = {
      .flashSectStart = FlashSectStart,
      .flashSectTotal = FlashSectTotal,
      .flashSectPageFactor = FlashSectPageFactor,
      .flashSectPageCount = FlashSectPageCount,
      .flashPageExp = FlashPageExp,
      .firstPageCountEmpty = 0,
    };
    RecoverFlashResult const result = recoverFlashLayout(
      config,
      this,
      recoverReadPage,
      recoverIsErased,
      recoverIsValid,
      recoverUnixOffset,
      [](char const *const message) {
        Serial.println(message);
      }
    );

    headL2 = result.headL2;
    countL2 = result.countL2;
  }

  void fetchAppend(uint32_t const millisCurrent) {
    struct SensorValue * value;
    uint16_t current;
    uint64_t unixSeconds;

    if (!dht.read(true)) {
      return;
    }

    if (countL0 == MaxHistoryL0) {
      if (!headL0) {
        if (countL1 == SensorSlice::MaxRecords) {
          flushL1L2();
        }
        appendL1(valuesL0[0], unixSecondsL0[0]);
      }
      current = headL0;
      headL0 = (headL0 + 1) & RingMaskL0;
    } else {
      current = (headL0 + countL0++) & RingMaskL0;
    }

    value = valuesL0 + current;

    millisLast = millisCurrent;
    unixSeconds = ntpSyncer.currentUnixSeconds(millisCurrent);
    unixSecondsL0[current] = unixSeconds;
    value->humidInt = dht.data[0];
    value->humidDot = dht.data[1];
    value->tempInt =  static_cast<int8_t>(dht.data[2]);
    value->tempDot = dht.data[3];
  }

  void firstFetchAppend(uint32_t const millisCurrent) {
    if (countL2 > 0 && fetchPage(slicePage(countL2 - 1))) {
      ntpSyncer.ensureUnixSeconds(millisCurrent, sliceL2.unixOffset + sliceL2.records[SensorSlice::MaxRecordsSub1].timestamp);
    }
    dht.begin();
    fetchAppend(millisCurrent);
  }

  void maybeFetchAppend(uint32_t const millisCurrent) {
    if (millisCurrent - millisLast >= MinInterval) {
      fetchAppend(millisCurrent);
    }
  }
};

static SensorHistory history = {};

void httpHandleLast() {
  SensorValue &value = history.last();
  char buffer[SensorValue::lenBufferTempAndHumid];
  int r;

  r = snprintf(buffer, SensorValue::lenBufferTempAndHumid, "%" PRId8 ".%" PRIu8 ",%" PRIu8 ".%" PRIu8 "", value.tempInt, value.tempDot, value.humidInt, value.humidDot);
  if (r < 0) {
    serverSendError(StringFormatFailure);
    return;
  }
  if (r >= SensorValue::lenBufferTempAndHumid) {
    serverSendError(StringWouldTruncate);
    return;
  }
  server.send(200, "text/plain", buffer, r);
}

void httpHandleTemp() {
  SensorValue &value = history.last();
  char buffer[SensorValue::lenBufferTempOrHumid];
  int r;

  r = snprintf(buffer, SensorValue::lenBufferTempOrHumid, "%" PRId8 ".%" PRIu8 "", value.tempInt, value.tempDot);
  if (r < 0) {
    serverSendError(StringFormatFailure);
    return;
  }
  if (r >= SensorValue::lenBufferTempOrHumid) {
    serverSendError(StringWouldTruncate);
    return;
  }
  server.send(200, "text/plain", buffer, r);
}

void httpHandleHumid() {
  SensorValue &value = history.last();
  char buffer[SensorValue::lenBufferTempOrHumid];
  int r;

  r = snprintf(buffer, SensorValue::lenBufferTempOrHumid, "%" PRIu8 ".%" PRIu8 "", value.humidInt, value.humidDot);
  if (r < 0) {
    serverSendError(StringFormatFailure);
    return;
  }
  if (r >= SensorValue::lenBufferTempOrHumid) {
    serverSendError(StringWouldTruncate);
    return;
  }
  server.send(200, "text/plain", buffer, r);
}

